create_clock -period 20 [get_ports clock]
set_clock_uncertainty -setup 3 [get_clocks clock]
set_input_delay -max 6 -clock clock [all_inputs]
set_output_delay -max 6 -clock clock [all_outputs]
